Repository: pigamux/pigamux.github.io
Catalog: games/edc/TheEvolutionOfTrust.tmx
Source language: en_us
Languages: pt_pt

source: (...this result is similar even if we put <g id="1">Grudger</g> & <g id="2">Detective</g> back in:)
pt_pt: (...este resultado é semelhante mesmo se colocarmos o <g id="1">Rancoroso</g> e o <g id="2">Detetive</g> de volta:)

source: start the evolution process!
pt_pt: iniciar o processo evolutivo!

source: stop the evolution process
pt_pt: parar o processo evolutivo

source: (Note: sometimes, a few <g id="1">Grudgers</g> may stick around, because when all players except <g id="2">Grudger</g> & <g id="3">Copycat</g> are eliminated, the two tie.) <x id="4"/><x id="5"/>
pt_pt: (Nota: às vezes, alguns <g id="1">Rancorosos</g> permanecem no ciclo evolutivo, porque quando todos os jogadores exceto o <g id="2">Rancoroso</g> e o <g id="3">Copião</g> são eliminados, os dois empatam.) <x id="4"/><x id="5"/>

source: So, it seems the math of game theory is telling us something: that <g id="6">Copycat's</g> philosophy, "Do unto others as you would have them do unto you", may be not just a <g id="7">moral</g> truth, but also a <g id="8">mathematical</g> truth.
pt_pt: Então, parece que a matemática da teoria dos jogos nos está a dizer alguma coisa: a filosofia daquele <g id="6">Copião</g>, "Faz aos outros aquilo que gostarias que te fizessem a ti", pode não ser só uma verdade <g id="7">moral</g>, mas também uma verdade <g id="8">matemática</g>.

source: However...
pt_pt: No entanto...

source: ...there's a problem: →
pt_pt: ... há um problema: →

source: Look around.
pt_pt: Olha em volta.

source: The world's full of total jerkwads. <x id="1"/><x id="2"/>
pt_pt: O mundo está repleto de completos idiotas. <x id="1"/><x id="2"/>

source: If <g id="3">Copycat</g> is the strategy in this repeated game of trust that's so powerful -- that even soldiers in World War I trenches independently "evolved" a similar strategy, called "live and let live" -- why, then, are there so many un-trusting, un-trustworthy people?
pt_pt: Se o <g id="3">Copião</g> é a estratégia (neste jogo repetido de confiança) que é tão poderosa -- que até mesmo soldados nas trincheiras da Primeira Guerra Mundial "desenvolveram" independentemente uma estratégia semelhante, chamada "vive e deixa viver" -- porque é que, então, há tantas pessoas que não confiam nos outros e que nem nas quais devemos confiar?

source: What's causing our epidemic of un-trust? <x id="4"/><x id="5"/>
pt_pt: O que é que está a causar a nossa epidemia de desconfiança? <x id="4"/><x id="5"/>

source: A clue's in that sentence itself.
pt_pt: Há uma pista naquela própria frase.

source: "In <g id="6">this</g> repeated game of trust."
pt_pt: "<g id="6">Neste</g> jogo repetido de confiança."

source: So far we've only talked about change in the players: what about <g id="7">a change in the game?</g>
pt_pt: Até agora só falamos da mudança nos jogadores: e que tal <g id="7">uma mudança no jogo?</g>

source: What could lead to...
pt_pt: O que é que poderia levar à...

source: ...the evolution of <g id="1">distrust?</g>
pt_pt: ...evolução da <g id="1">desconfiança?</g>

source: Before everything goes to heck, let's start with something nice!
pt_pt: Antes que vá tudo para o caraças, vamos começar com alguma coisa de jeito!

source: Here's a world filled entirely with <g id="1">Always Cooperates</g>, except for one <g id="2">Always Cheat</g> and one <g id="3">Copycat</g>. <x id="4"/><x id="5"/>
pt_pt: Aqui está um mundo inteiramente repleto de <g id="1">Cooperadores</g>, exceto por um <g id="2">Traidor</g> e um <g id="3">Copião</g>. <x id="4"/><x id="5"/>

source: Use the buttons on the right to <g id="6">START</g> the sim, go through it <g id="7">step-by-step</g>, or <g id="8">reset</g> it.
pt_pt: Usa os botões à direita para <g id="6">INICIAR</g> a simulação, analisa-a <g id="7">passo a passo</g>, ou <g id="8">reinicia-a</g>.

source: As you already know, <g id="1">Copycat</g> wins handily in the long run, under our current rules! <x id="2"/><x id="3"/>
pt_pt: Como já sabes, o <g id="1">Copião</g> ganha facilmente a longo prazo, conforme as nossas regras atuais! <x id="2"/><x id="3"/>

source: But that's under our <g id="4">current</g> rules, which say that players play against each other for <g id="5">10</g> rounds per match.
pt_pt: Mas isso é conforme as nossas regras <g id="4">atuais</g>, que dizem que os jogadores jogam uns contra os outros <g id="5">10</g> rondas por partida.

source: Does <g id="6">Copycat</g> still win at 7 rounds?
pt_pt: Será que o <g id="6">Copião</g> ainda ganha se forem 7 rondas?

source: 5 rounds?
pt_pt: 5 rondas?

source: <g id="9">Change the number of rounds</g> with the slider below, then <g id="10">START</g> the sim, and see what happens.
pt_pt: <g id="9">Altera o número de rondas</g> com a barra deslizante abaixo, depois <g id="10">INICIA</g> a simulação, e vê o que acontece.

source: Feel free to experiment!
pt_pt: Está à vontade para experimentar!

source: once you're done playing around, click:
pt_pt: quando terminares, clica em:

source: As you saw, if you don't play enough rounds, (here: 5 or less) <g id="1">ALWAYS CHEAT</g> dominates. <x id="2"/><x id="3"/>
pt_pt: Como viste, se não jogares rondas suficientes, (aqui: 5 ou menos) o <g id="1">TRAIDOR</g> domina. <x id="2"/><x id="3"/>

source: In 1985, when Americans were asked how many close friends they had, the most common answer was "three".
pt_pt: Em 1985, quando perguntaram a americanos quantos amigos próximos é que tinham, a resposta mais comum foi "três".

source: In 2004, the most common answer was <g id="4">"zero"</g>.
pt_pt: Em 2004, a resposta mais comum foi <g id="4">"zero"</g>.

source: We now have fewer friends across class, racial, economic, and political lines, because we have fewer friends -- <g id="5">period.</g>
pt_pt: Atualmente temos menos amigos de diferentes classes, raças, e linhas de pensamento económicas e políticas, porque temos menos amigos -- <g id="5">ponto final.</g>

source: And as you just discovered for yourself, <g id="6">the fewer "repeat interactions" there are, the more distrust will spread.</g> <x id="7"/><x id="8"/> (no, mass media doesn't count: it must be <g id="9">two-way</g> interactions between <g id="10">specific individuals</g>.)
pt_pt: E como acabaste de descobrir por ti próprio, <g id="6">quanto menos "interações repetidas" houver, mais a desconfiança propagar-se-á.</g> <x id="7"/><x id="8"/> (não, os mass media não contam: devem ser interações <g id="9">mútuas</g> entre <g id="10">indivíduos específicos</g>.)

source: and oh, it gets worse...
pt_pt: e oh, fica pior...

source: There's <g id="1">another</g> way to breed distrust.
pt_pt: Há uma <g id="1">outra</g> maneira de gerar desconfiança.

source: Here are the "payoffs" for the trust game:
pt_pt: Aqui estão as "recompensas" para o jogo da confiança:

source: With the normal payoffs, <g id="1">Copycat</g> wins.
pt_pt: Com as recompensas normais, o <g id="1">Copião</g> ganha.

source: But now, <g id="2">change the "both cooperate" reward from +2 to +1</g>, then click <g id="3">START</g>.
pt_pt: Mas agora, <g id="2">altera a recompensa de "ambos cooperam" de +2 para +1</g>, e depois clica em <g id="3">INICIAR</g>.

source: Even though +1 is still <g id="4">more</g> than the punishment for both cheating (0)... what happens?
pt_pt: Apesar de +1 ainda ser <g id="4">maior</g> do que a punição por ambos traírem (0)... o que é que acontece?

source: feel free to play around with different payoffs!
pt_pt: está à vontade para experimentar com diferentes recompensas!

source: once you're done, click:
pt_pt: quando terminares, clica em:

source: (simulating: 10 rounds per match)
pt_pt: (a simular: 10 rondas por partida)

source: The same thing happens: with a lower "win-win" reward, <g id="1">Always Cheat</g> takes over.
pt_pt: Acontece a mesma coisa: com uma recompensa onde ambos saem a ganhar mais baixa, o <g id="1">Traidor</g> assume a liderança.

source: Game theory has two powerful ideas about this: <x id="2"/><x id="3"/> <g id="4">"Zero-sum game".</g>
pt_pt: A teoria dos jogos tem duas ideias poderosas sobre isto: <x id="2"/><x id="3"/> <g id="4">"Jogo de soma zero".</g>

source: This is the sadly common belief that a gain for "us" <g id="5">must</g> come at a loss to "them", and vice versa. <x id="6"/><x id="7"/>
pt_pt: Esta é a triste crença comum de que um ganho para "nós" <g id="5">deve</g> resultar numa perda para "eles", e vice-versa. <x id="6"/><x id="7"/>

source: <g id="8">"Non-zero-sum game".</g>
pt_pt: <g id="8">"Jogo de soma diferente de zero".</g>

source: This is when people make the hard effort to create a win-win solution!
pt_pt: É quando as pessoas fazem o grande esforço de criar uma solução onde ambas as partes saem a ganhar!

source: (or at least, avoid a lose-lose) Without the non-zero-sum game, <g id="9">trust cannot evolve.</g> <x id="10"/><x id="11"/>
pt_pt: (ou pelo menos, evitar uma situação onde ambas saem a perder) Sem o jogo de soma diferente de zero, a <g id="9">confiança não consegue evoluir.</g> <x id="10"/><x id="11"/>

source: Speaking of which, let's now look at our third & final barrier to the evolution of trust...
pt_pt: Por falar nisso, vamos agora analisar a nossa terceira e última entrave à evolução da confiança...

source: <g id="1">Misteaks</g> Mistakes.
pt_pt: <g id="1">Errod</g> Erros.

source: As cool as <g id="1">Copycat</g> is, it has a huge, fatal weakness I haven't mentioned yet.
pt_pt: Por mais fixe que o <g id="1">Copião</g> seja, ele tem uma fraqueza enorme e fatal que eu ainda não mencionei.

source: To understand the problem, let's say two <g id="2">Copycats</g> are playing against each other:
pt_pt: Para compreender o problema, digamos que dois <g id="2">Copiões</g> estejam a jogar um contra o outro:

source: Being "nice" players, both their first moves will be:
pt_pt: Sendo jogadores "simpáticos", as primeiras jogadas dos dois serão:

source: And normally, they'd just pay back each others' kindness and sing Kumbaya until the end of time.
pt_pt: E normalmente, eles retribuiriam a simpatia um do outro e cantariam Kumbaya até ao fim dos tempos.

source: But what if, while trying to reciprocate goodness...
pt_pt: Mas e se, enquanto tentavam retribuir bondade...

source: <g id="1">OH NO</g> <x id="2"/> Mistakes, miscommunication, misinterpretations -- accidents happen all the time in real life.
pt_pt: <g id="1">OH NÃO</g> <x id="2"/> Erros, falhas de comunicação, más interpretações -- acidentes acontecem o tempo todo na vida real.

source: But if the other person doesn't <g id="1">think</g> it was an accident...
pt_pt: Mas se a outra pessoa não <g id="1">achar</g> que foi um acidente...

source: <g id="1">OH NO TIMES TWO</g> <x id="2"/> The other player, being a <g id="3">Copycat</g>, <g id="4">had</g> to retaliate...
pt_pt: <g id="1">OH NÃO VEZES DOIS</g> <x id="2"/> O outro jogador, sendo um <g id="3">Copião</g>, <g id="4">teve</g> que retaliar...

source: ...and you, being a <g id="1">Copycat</g> as well, will <g id="2">also</g> have to retaliate...
pt_pt: ...e tu, sendo também um <g id="1">Copião</g>, <g id="2">também</g> terás que retaliar...

source: Thus, like the Hatfields and McCoys, these two <g id="1">Copycats</g> will spiral into an endless cycle of vengeance... that started over a single mistake, long ago.
pt_pt: Assim, tal como os Hatfields e os McCoys, estes dois <g id="1">Copiões</g> vão entrar num ciclo infinito de vingança... que começou por causa de um único erro, há muito tempo atrás.

source: Tragic.
pt_pt: Trágico.

source: But now, are there <g id="1">other</g> types of players who can...
pt_pt: Mas e agora, haverá <g id="1">outros</g> tipos de jogadores que conseguem...

source: ...deal with mistakes?
pt_pt: ...lidar com erros?

source: Let's meet some new faces!
pt_pt: Vamos conhecer umas caras novas!

source: (or, new hats, anyway)
pt_pt: (ou, chapéus novos, seja como for)

source: <g id="1">COPYKITTEN:</g><x id="2"/> Hello!
pt_pt: <g id="1">COPIINHO:</g><x id="2"/> Olá!

source: I'm like <g id="3">Copycat</g>, except I Cheat back only after you Cheat me twice in a row.
pt_pt: Eu sou como o <g id="3">Copião</g>, só que eu só Traio de volta depois de ter sido Traído duas vezes seguidas.

source: After all, the first one could be a mistake!
pt_pt: Afinal, a primeira pode ter sido um erro!

source: <g id="1">SIMPLETON:</g><x id="2"/> hi i try start cooperate. if you cooperate back, i do <g id="3">same thing</g> as last move, even if it mistake. if you cheat back, i do <g id="4">opposite thing</g> as last move, even if it mistake.
pt_pt: <g id="1">SIMPLÓRIO:</g><x id="2"/> ola eu tentar começar a cooperar. se tu cooperar de volta, eu fazer o <g id="3">mesmo</g> que a minha ultima jogada, mesmo que ter sido um erro. se tu trair de volta, eu fazer o <g id="4">oposto</g> da minha ultima jogada, mesmo que ter sido um erro.

source: <g id="1">RANDOM:</g><x id="2"/> <bx id="3"/>Monkey robot!
pt_pt: <g id="1">ALEATÓRIO:</g><x id="2"/> <bx id="3"/>Robô macaco!

source: Ninja pizza tacos!
pt_pt: Tacos ninja de pizza!

source: lol i'm so random<ex id="_3"/><x id="4"/> (Just plays Cheat or Cooperate randomly with a 50/50 chance)
pt_pt: lol sou tão aleatório<ex id="_3"/><x id="4"/> (Trai ou Coopera aleatoriamente com 50/50 de chance)

source: Alright, let's see how well these peeps do when they...
pt_pt: Ok, vamos lá ver o quão bem estes tipos se saem quando...

source: ...play in a tournament →
pt_pt: ...jogam num torneio →

source: Let's start with a dozen <g id="1">Always Cooperates</g>, versus our old winner, the fair <g id="2">Copycat</g>, and our three new characters: the forgiving <g id="3">Copykitten</g>, the dull <g id="4">Simpleton</g>, and the silly <g id="5">Random</g>. <x id="6"/><x id="7"/>
pt_pt: Comecemos com uma dúzia de <g id="1">Cooperadores</g>, contra o nosso velho vencedor, o justo <g id="2">Copião</g>, e as nossas três novas personagens: o misericordioso <g id="3">Copiinho</g>, o aborrecido <g id="4">Simplório</g>, e o totó do <g id="5">Aleatório</g>. <x id="6"/><x id="7"/>

source: In each round of a match, players have a small chance of making a mistake. (let's say, 5%) Who do you think will come out on top?
pt_pt: Em cada ronda de uma partida, os jogadores têm uma pequena chance de cometer um erro. (digamos, 5%) Quem é que achas que vai levar a melhor?

source: <g id="8">Think carefully, then PLACE YOUR BETS:</g>
pt_pt: <g id="8">Pensa bem, e depois FAZ A TUA APOSTA:</g>

source: Alright, you bet [CHAR] wins.
pt_pt: Muito bem, apostas que o [CHAR] vai ganhar.

source: Let's find out!
pt_pt: Vamos lá descobrir!

source: Use the controls to your left to <g id="1">START</g> the sim in quick mode, or go through it <g id="2">step-by-step</g>.
pt_pt: Usa os botões à tua esquerda para <g id="1">INICAR</g> a simulação no modo rápido, ou analisa-a <g id="2">passo a passo</g>.

source: You were correct --
pt_pt: Acertaste --

source: Your bet was close, but no cigar --
pt_pt: Quase, mas não foi desta vez --

source: <g id="1">Simpleton</g> wins!
pt_pt: Ganhou o <g id="1">Simplório</g>!

source: This is because <g id="2">Simpleton</g> is actually capable of exploiting <g id="3">Always Cooperate</g>.
pt_pt: Tal deve-se ao facto de que o <g id="2">Simplório</g> é, na verdade, capaz de explorar o <g id="3">Cooperador</g>.

source: They both start cooperating, but if <g id="4">Simpleton</g> makes a mistake and cheats, since <g id="5">Always Cooperate</g> never retaliates, <g id="6">it'll keep cheating them</g>.
pt_pt: Ambos começam a cooperar, mas se o <g id="4">Simplório</g> cometer um erro e trair o <g id="5">Cooperador</g>, uma vez que o segundo nunca retalia, <g id="6">o primeiro vai continuar a traí-lo</g>.

source: Now let's try...
pt_pt: Tentemos agora...

source: ...the same thing as before, except instead of half-<g id="1">Always Cooperate</g>, it's half-<g id="2">Always Cheat</g>.
pt_pt: ...a mesma coisa que antes, só que em vez de metade de <g id="1">Cooperadores</g>, será metade de <g id="2">Traidores</g>.

source: It's a much <g id="3">less</g> forgiving, <g id="4">more</g> hostile environment. <x id="5"/><x id="6"/>
pt_pt: É um ambiente bem <g id="3">menos</g> perdoador, bem <g id="4">mais</g> hostil. <x id="5"/><x id="6"/>

source: Who do you think will win now?
pt_pt: Quem é que achas que vai ganhar desta vez?

source: <g id="7">Think, then PLACE YOUR BETS:</g>
pt_pt: <g id="7">Pondera, e depois FAZ A TUA APOSTA:</g>

source: You bet on [CHAR].
pt_pt: Apostas no [CHAR].

source: Again, go through the simulation...
pt_pt: Mais uma vez, analisa a simulação...

source: You were right on the money --
pt_pt: Está... CERTAAAAAA! --

source: Good guess, but someone else took the prize --
pt_pt: Bom palpite, mas outra pessoa levou o prémio --

source: <g id="1">Copykitten</g> wins this time!
pt_pt: É o <g id="1">Copiinho</g> quem ganha desta vez!

source: That's surprising that with an even <g id="2">meaner</g> starting population, <g id="3">Copykitten</g>, a <g id="4">more forgiving</g> version of <g id="5">Copycat</g>, was the most successful!
pt_pt: É surpreendente que com uma população inicial ainda <g id="2">mais maldosa</g>, o <g id="3">Copiinho</g>, uma versão <g id="4">mais tolerante</g> do <g id="5">Copião</g>, foi o mais bem sucedido!

source: (note: <g id="6">Copykitten</g> is so forgiving it doesn't even <g id="7">entirely</g> wipe out <g id="8">Copycat</g>. it shares room) <x id="9"/><x id="10"/> In this case, a bit of "miscommunication" (5% chance of mistake each round) could lead to more <g id="11">forgiveness</g>.
pt_pt: (nota: o <g id="6">Copiinho</g> perdoa tanto que nem <g id="7">arrasa</g> com o <g id="8">Copião</g> por completo. partilha o espaço) <x id="9"/><x id="10"/> Neste caso, um pouco de "falhas de comunicação" (5% de chance de erro a cada ronda) pode levar a mais <g id="11">perdão</g>.

source: But is this true for <g id="12">all</g> levels...
pt_pt: Mas será que isto é verdade para <g id="12">todos</g> os níveis...

source: ...of miscommunication?
pt_pt: ...de falhas de comunicação?

source: <g id="1">Use the slider below to change the amount of "miscommunication", then hit START.</g>
pt_pt: <g id="1">Usa a barra deslizante abaixo para alterar a quantidade de "falhas de comunicação", e depois clica em INICIAR.</g>

source: At 5%, <g id="2">Copykitten</g> wins.
pt_pt: A 5%, o <g id="2">Copiinho</g> ganha.

source: What happens at 0%?
pt_pt: O que é que acontece a 0%?

source: Or 20%?
pt_pt: Ou 20%?

source: Or 50%?
pt_pt: Ou 50%?

source: (it only goes up to 50%, because at that point, <g id="3">every</g> move is a coin flip)
pt_pt: (só vai até 50%, porque a essa altura, <g id="3">todas</g> as jogadas são um 50/50)

source: When you're done playing around, click:
pt_pt: Quando terminares, clica em:

source: The results turn out something like this:<x id="1"/> <g id="2">At 0%,</g> the fair <g id="3">Copycat</g> wins!
pt_pt: Os resultados revelam-se algo deste tipo:<x id="1"/> <g id="2">A 0%,</g> o justo <g id="3">Copião</g> ganha!

source: <g id="4">At 1% to 9%,</g> the forgiving <g id="5">Copykitten</g> wins!
pt_pt: <g id="4">A 1% até 9%,</g> o misericordioso <g id="5">Copiinho</g> ganha!

source: <g id="6">At 10% to 49%:</g> the unfair, unforgiving <g id="7">Always Cheat</g> wins.
pt_pt: <g id="6">A 10% até 49%:</g> o injusto e impiedoso <g id="7">Traidor</g> ganha.

source: <g id="8">At 50%,</g> <g id="9">nobody wins ever.</g> <x id="10"/><x id="11"/>
pt_pt: <g id="8">A 50%,</g> <g id="9">ninguém nunca ganha.</g> <x id="10"/><x id="11"/>

source: This is why "miscommunication" is such an interesting barrier to trust: a <g id="12">little</g> bit of it leads to forgiveness, but <g id="13">too much</g> and it leads to widespread distrust!
pt_pt: É por isto que "faltas de comunicação" são entraves à confiança tão interessantes: um <g id="12">pouco</g> dela leva ao perdão, mas <g id="13">demasiado</g> leva à desconfiança generalizada!

source: I think our modern media technology, as much as it's helped us increase communication... has increased our <g id="14">miscommunication</g> much more. <x id="15"/><x id="16"/>
pt_pt: Penso que a nossa tecnologia moderna dos média, por muito que nos tenha ajudado a aumentar a comunicação... aumentou muito mais a nossa <g id="14">falta de comunicação</g>. <x id="15"/><x id="16"/>

source: At last, let's experiment with <g id="17">all</g> the numbers, the knobs and sliders.
pt_pt: Por fim, vamos experimentar com <g id="17">todos</g> os números, botões e barras deslizantes.

source: Let's play...
pt_pt: Vamos jogar...

source: ...in the Sandbox Mode!
pt_pt: ...no Modo Sandbox!

source: Start off with this distribution of players:
pt_pt: Começa com esta distribuição de jogadores:

source: The payoffs in a one-on-one game are:
pt_pt: As recompensas num jogo de um contra um são:

source: set default
pt_pt: definições padrão

source: Play [N] rounds per match:
pt_pt: Jogar [N] rondas por partida:

source: Play [N] round per match:
pt_pt: Jogar [N] ronda por partida:

source: After each tournament, eliminate the bottom [N] players & reproduce the top [N] players:
pt_pt: Após cada torneio, eliminar os [N] piores jogadores e reproduzir os [N] melhores jogadores:

source: After each tournament, eliminate the bottom [N] player & reproduce the top [N] player:
pt_pt: Após cada torneio, eliminar o [N] pior jogador e reproduzir o [N] melhor jogador:

source: During each round, there's a [N]% chance a player makes a mistake:
pt_pt: Durante cada ronda, há [N]% de chances de um jogador cometer um erro:

source: <g id="1">NOTE: Sandbox Mode is totally optional.</g>
pt_pt: <g id="1">NOTA: o Modo Sandbox é totalmente opcional.</g>

source: Feel free to skip it, or play around!
pt_pt: Está à vontade para passá-lo à frente, ou explorá-lo!

source: Once you're done, let's recap...
pt_pt: Quando terminares, vamos recapitular...

source: what we learnt today!
pt_pt: o que aprendemos hoje!

source: Game theory has shown us the three things we need for the evolution of trust:
pt_pt: A teoria dos jogos mostrou-nos as três coisas de que precisamos para a evolução da confiança:

source: 1. REPEAT INTERACTIONS
pt_pt: 1. REPETIR INTERAÇÕES

source: Trust keeps a relationship going, but you need the knowledge of possible future repeat interactions <g id="1">before</g> trust can evolve.
pt_pt: A confiança mantém uma relação em andamento, mas é necessário o conhecimento de possíveis futuras interações repetidas <g id="1">antes</g> de a confiança poder evoluir.

source: 2. POSSIBLE WIN-WINS
pt_pt: 2. POSSÍVEIS SITUAÇÕES ONDE AMBOS SAEM A GANHAR

source: You must be playing a non-zero-sum game, a game where it's at least possible that <g id="1">both</g> players can be better off -- a win-win.
pt_pt: Deves jogar um jogo de soma diferente de zero, um jogo onde é pelo menos possível que <g id="1">ambos</g> os jogadores possam estar numa situação melhor -- esta é uma situação onde ambos saem a ganhar.

source: 3. LOW MISCOMMUNICATION
pt_pt: 3. BAIXA FALHA DE COMUNICAÇÃO

source: If the level of miscommunication is <g id="1">too</g> high, trust breaks down.
pt_pt: Se o nível de falhas de comunicação for <g id="1">demasiado</g> alto, a confiança é quebrada.

source: But when there's a little bit of miscommunication, it pays to be <g id="2">more</g> forgiving.
pt_pt: Mas quando há um pouquinho de falhas de comunicação, vale a pena ser <g id="2">mais</g> perdoador.

source: Of course, real-world trust is affected by much more than this.
pt_pt: Claro, a confiança no mundo real é afetada por muito mais do que isto.

source: There's reputation, shared values, contracts, cultural markers, blah blah blah.
pt_pt: Há reputação, valores partilhados, contratos, marcadores culturais, blá blá blá.

source: And let's not forget...
pt_pt: E não esqueçamos...
